# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    if p1[1] == p2[1] == p3[1] or p1[0] == p2[0] == p3[0]:
        return False
    a = (p2[1] - p1[1]) / (p2[0] - p1[0])
    b = (p3[1] - p1[1]) / (p3[0] - p1[0])
    return a != b


# Пример вызова функции
can_triangle((10, 12), (14, 18), (12, 12))
can_triangle((10, 12), (10, 18), (10, 12))
can_triangle((10, 12), (14, 12), (12, 12))
can_triangle((1, 1), (2, 2), (3, 3))
can_triangle((1, 2), (12, 32), (13, 43))
